<template>
  <div class="authorize-agreement">
    <mt-header v-if="isShowNav" title="《委托及授权协议》">
      <mt-button icon="back" slot="left" @click="$router.goBack('')"></mt-button>
    </mt-header>
    <div :style="toTopStyle" class="main-content">
      <p class="important-content">用户须知：您确认，如您请点击选择同意此协议将视为对以下协议内容进行委托和授权，并将视为已阅读并理解本协议的全部内容，充分理解并同意接受本协议的全部内容。本协议会对与您的权益具有或可能具有重大关系的条款，以及对本公司具有或可能具有免责或限制责任的条款均用粗体字标注，请您注意。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作。</p>
      <h2>委托及授权协议</h2>
      <p class="normal-content">本协议由广东乐数信息科技有限公司（以下简称本公司或乐宝卡）和您签订。本协议作为《乐宝卡服务与隐私协议》及《快捷签署协议》的补充协议，在其基础上作补充授权。</p>
      <div class="chapter">
        <h3>一、授权条款</h3>
        <p class="normal-content">您在本合同中无条件且不可撤销地授权乐宝卡如下内容：</p>
        <p class="important-content">1.您知悉并确认，若乐宝卡或乐宝卡合作的任何第三方（简称“垫付方”）对您的逾期款项进行了代偿/垫付，则逾期债权对应的债权人变更为垫付方，该垫付行为并不免除您因逾期需承担的各项后果，包括您应支付的罚息、逾期违约金、催收费用、产生不良的信用记录等，您仍应按照本合同及注册协议的约定承担违约责任。您知悉并确认除非必要，乐宝卡及资金方无需就上述垫付及债权转让事宜另行通知您，是否通知您不影响垫付方取得相应债权，您不得以任何理由拒绝或延迟还款。</p>
        <p class="important-content">2. 您知悉并确认，您将授权乐宝卡在满足您的资金需求的过程中，可能会给您匹配正规的金融机构提供资金。此类正规金融机构有权按照国家相关规定，将您个人的信用信息报送给央行个人信用信息基础数据库和经央行批准设立的征信机构。</p>
        <p class="important-content">3. 您授权乐宝卡有权代您注册、使用其电子签名认证证书。电子签名认证证书授权的使用范围仅限于本次融资需求（签署相应借款合同），乐宝卡不得挪作他用。此外，乐宝卡有权将该项权利进行转委托，无需另行获得您的同意或通知您。</p>
        <p class="important-content">4. 您同意并授权，您注册使用本服务时，即授权本公司根据您所提供的各项信息及本公司独立获得的信息评定您在本公司所拥有的个人信用风险，或决定是否审核通过您的服务申请。您向本公司提交有关信息和资料的行为，均应视为已合法授权本公司因提供本服务的需要而对您相关信息（包括但不限于身份信息、学历信息、消费信息等）进行采集、储存、整理、加工，并按照本服务条款的约定向第三方提交风险评估结论或其他相关资料。您知晓并同意，在不透露单个用户的具体信息内容的前提下，本公司有权对整个用户数据库进行分析，并对用户数据库进行商业上的利用。</p>
        <p class="important-content">5. 您同意并授权，为了向您提供约定服务之必要，您作为委托人不可撤销地在此授权本公司代为办理相关事项，包括但不限于以您的名义在第三方服务平台上及该等平台指定的第三方支付机构注册账户并设置初始密码、代为提交材料、代为签署相关协议、代为接收或交付约定款项等，承诺本公司作为受托人在该账户下进行的前述操作均代表委托人的真实意思表示，委托人承担因该等操作而产生或可能产生的一切法律后果，并按照该等合同或文件的约定行使权利并履行义务，您同意本公司有权将前述授权事项进行转委托。您有权修改初始密码并自行操作前述授权事项，但应事先书面通知本公司及该等第三方服务平台。您理解并认可，如因您未及时操作或操作不当造成任何风险或损失，或因您在未通知本公司或该等第三方服务平台的前提下自行选择修改初始密码导致本公司不能执行前述授权事项，从而造成任何风险或损失的，由您自行承担，本公司不负有任何责任。</p>
        <p class="important-content">6. 您理解并同意，如您使用了本公司合作的第三方机构的提现或支付或贷款功能，则应当依据您签署的相关融资协议或服务协议中约定之日期按期进行还款，本公司有权基于该等第三方机构的授权通过短信、电话、社交账号等途径对您进行服务与还款提醒。您理解并同意，如您未有按期履行还款义务，您的个人逾期信息将可能向第三方（包括但不限于征信系统、金融机构等）进行分享或公布，对此造成的不良后果您已知悉并确认。</p>
        <p class="important-content">7. 您的收入、存款、有价证券、商业保险、不动产信息和纳税数额等信息对于您而言是相当私密且重要的，如果您在使用本服务的过程中，向本公司提供了上述信息，您明确并保证，您已经充分理解并知晓该等信息被提供和使用的风险，包括但不限于：上述信息可能对您的信用评价、以及分析报告等结果产生不利影响，且该等信息被本公司依法提供给第三方后被他人不当利用的风险，以及因您的信用状况较好而造成您被不良信息骚扰的风险。</p>
        <p class="important-content">8.您同意并授权，在您授权我们验证您的学信网信息后，我们有权登陆学信网查看并读取您的学籍信息。您同意，在您使用学信网认证服务时，若您没有注册过学信网账户，我们有权代您申请注册学信网账户，之后将学信网账户名及密码告知于您。</p>
        <p class="important-content">9.您同意并授权，在您授权我们验证并获取您的淘宝网及支付宝信息后，我们有权登陆淘宝网及支付宝查看并读取包括但不限于您的账户及交易信息。</p>
        <p class="important-content">10.您同意并授权，在您授权我们获取您的通讯录后，我们有权通过您的电子设备及通讯设备等获取您的包括但不限于联系人姓名、联系方式等全部信息。</p>
        <p class="important-content">11.您同意并授权，在您授权我们验证并获取您的手机运营商信息后，我们有权查看并读取包括但不限于您的用户身份信息、是否实名认证、通话记录、手机账单等信息。</p>
        <p class="important-content">12.您同意并授权，在申请借款、审批及贷后管理期间，乐宝卡以及乐宝卡合作的查询服务提供机构可以向中国人民银行征信中心及其分支机构以及其他信息服务机构查询并获取您的个人信息。查询服务提供机构可以可将合法获取的您的信息经过整合、加工并转化为信息评分或信息报告回传乐宝卡，用于您的申请借款、审批及贷后管理等事项。</p>
        <p class="important-content">13.您同意并授权，为更好、更完整地展现您的资信情况，查询服务提供机构及其关联公司及其指定的第三方可留存、整理及加工本次获取的本人信息用于查询服务提供机构及其关联公司及其指定的第三方为本人提供的其他服务中，关联公司及其指定第三方应该承担保密义务。</p>
        <p class="important-content">14.您同意并授权，乐宝卡、出借人可以通过查询服务提供机构向包括但不限于中国人民银行征信中心及其分支机构、公安系统以及其他信息服务机构等上传本人在本次借款过程生成的资信信息。同时，本人同意并授权包括但不限于中国人民银行征信中心及其分支机构以及其他信息服务机构接收乐宝卡、出借人通过查询服务提供机构上传的本人在本次借款过程生成的资信信息。</p>
        <p class="important-content">15.您同意并授权，为更好地为您提供服务，查询服务机构可与其合作的第三方进行联合研究，并可将通过本授权书获得的本人信息投入到该等联合研究中。但查询服务机构与其合作的第三方在开展上述联合研究前，应要求其合作的第三方对在联合研究中所获取的本人信息予以保密。</p>
        <p class="important-content">16.上述委托期限为自生效之日起至本标准条款及订单项下的义务全部履行完毕之日止。在您未履行完毕本标准条款及订单义务之前，您不得单方终止上述委托。</p>
      </div>
      <div class="chapter">
        <h3>二、保密条款</h3>
        <p class="normal-content">本公司重视对用户隐私的保护。因收集您的信息是出于遵守国家法律法规的规定以及向您提供服务及提升服务质量的目的，我们对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，我们会在下列情况下才将您的信息与第三方共享：</p>
        <p class="normal-content">1、获得您的同意或授权。</p>
        <p class="normal-content">2、为了向您提供或推荐服务、产品，或为了向您提供更完善的服务，或者为了让您拥有更广泛的社交体验，我们会与包括本公司关联公司及合作商户在内的第三方共享您的相关信息。</p>
        <p class="normal-content">3、某些情况下，只有共享您的信息，才能提供您需要的服务和（或）产品，或处理您与他人的交易纠纷或争议。</p>
        <p class="normal-content">4、为了判断您的乐宝卡账户或交易是否安全。</p>
        <p class="normal-content">5、某些服务和（或）产品由我们的合作伙伴提供或由我们与合作伙伴、供应商共同提供，我们会与其共享提供服务和（或）产品需要的信息。</p>
        <p class="normal-content">6、我们与第三方进行联合推广活动，我们可能与其共享活动过程中产生的、为完成活动所必要的个人信息。</p>
        <p class="normal-content">7、为维护乐宝卡及乐宝卡关联公司和其他乐宝卡用户的合法权益。</p>
        <p class="normal-content">8、根据法律规定及合理商业习惯，在我们计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行）时，以及其他情形下我们需要接受来自其他主体的尽职调查时，我们会把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施。</p>
        <p class="normal-content">9、如您授权第三方向乐宝卡查询、采集您乐宝卡账户相关信息，我们有权在法律法规和您的授权许可范围内向第三方分享您乐宝卡账户的部分信息。</p>
        <p class="normal-content">10、为了维护和改善我们的服务。</p>
        <p class="normal-content">11、根据法律法规的规定或有权机关的要求。</p>
        <p class="normal-content">12、您理解并同意，我们可以储存您授权的原始信息；在您和我们的合作存续期间，我们随时可以从新采集和更新数据，对于经过加工和脱敏处理的数据，我们可以永久保存在服务器上；对于原始数据，在合作结束后，我们保留最长不超过90天。</p>
      </div>
      <div class="chapter">
        <h3>三、用户义务及免责声明</h3>
        <p class="important-content">（一）您保证，本《委托及授权协议》中的所有关于您的信息的授权均为您本人操作并为本人身份信息，不可用他人的身份信息或虚假信息。</p>
        <p class="normal-content">（二）如您借他人之名授权，我们将有权暂停或终止与您的全部或部分服务协议，并将由您承担由此行为所产生的全部法律责任，我们将不对此承担法律责任。</p>
      </div>
    </div>
  </div>
</template>
<script>
  export default {
    name: "authorize-agreement",
    data() {
      return {
        isShowNav: true
      }
    },
    computed: {
      toTopStyle() {
        if (this.isShowNav) {
          return {
            "padding": "48px 15px 15px 15px"
          }
        } else {
          return {
            "padding": "0px 15px 15px 15px"
          }
        }
      }
    },
    created() {
      if(this.$route.query) {
        this.isShowNav = this.$route.query.isShowNav;
      } else {
        this.isShowNav = false;
      }
    }
  }

</script>

<style lang="less" scoped>
  @w: 75rem;
  .authorize-agreement {
    background-color: white !important;
    .main-content {
      padding: 48px 15px 15px 15px;
      background-color: white;
      h2 {
        text-align: center;
        font-weight: 500;
      }
      .important-content {
        text-indent: 60/@w;
        font-size: 30/@w;
        font-weight: 600;
        letter-spacing: 1px;
        line-height: 45/@w;
      }
      .normal-content {
        text-indent: 60/@w;
        letter-spacing: 1px;
        line-height: 45/@w;
      }
    }
  }

</style>
